cask_args appdir: '/Applications'
tap 'getsentry/tools'
tap 'homebrew/cask'
tap 'jjochen/cask'
tap 'vapor/tap'
tap 'dart-lang/dart'


brew 'ansible'
brew 'ansible-lint'
brew 'astyle'
brew 'bash'
brew 'bash-completion'
brew 'carthage'
brew 'chruby'
brew 'circleci'
brew 'clang-format'
brew 'cmake'
brew 'cmatrix'
brew 'cocoapods'
brew 'coreutils'
brew 'dart'
brew 'exa'
brew 'fasd'
brew 'ffmpeg'
brew 'findutils'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'git-standup'
brew 'gnupg'
brew 'graphicsmagick'
brew 'gs'
brew 'htop'
brew 'imagemagick' # --with-fontconfig --with-librsvg --with-ghostscript'
brew 'librsvg'
brew 'mas'
brew 'mint'
brew 'moreutils'
brew 'node'
brew 'openssl'
#brew 'phantomjs'
brew 'potrace'
brew 'rcm'
brew 'readline'
brew 'ruby-install'
brew 'sentry-cli' # getsentry/tools
brew 'ssh-copy-id'
brew 'subversion'
brew 'swi-prolog'
brew 'swiftformat'
brew 'swiftlint'
brew 'switchaudio-osx'
brew 'tmate'
brew 'unp'
brew 'vapor' # vapor/tap
brew 'vim', args: ['--override-system-vi']
brew 'watchman'
brew 'wget'
brew 'xcproj'
brew 'xctool'
brew 'yamllint'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'


cask '1password'
cask 'airfoil'
cask 'alfred'
cask 'android-studio'
cask 'arduino'
cask 'atom'
cask 'base'
cask 'betterzipql'
cask 'bunqcommunity-bunq'
cask 'burn'
cask 'caffeine'
cask 'chrysalis'
cask 'db-browser-for-sqlite'
cask 'discord'
cask 'displaylink'
cask 'dropbox'
cask 'flycut'
cask 'github-desktop'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'handbrake'
cask 'hazel'
cask 'istat-menus'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'kawa'
cask 'mactex'
cask 'macvim'
cask 'model01commander'
cask 'nucleo'
cask 'paintcode'
cask 'postman'
cask 'provisioning'
cask 'provisionql'
cask 'qlmarkdown'
cask 'qlswift'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'realm-browser'
cask 'renamer'
cask 'sequel-pro'
cask 'sf-symbols'
cask 'sketch'
cask 'skim'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'spotter'
cask 'swiftformat-for-xcode'
cask 'teamviewer'
cask 'textmate'
cask 'the-unarchiver'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'xscope'
cask 'zoom'


mas 'DaisyDisk', id: 411643860
mas 'Developer', id: 640199958
mas 'GarageBand', id: 682658836
mas 'Gemini', id: 463541543
mas 'Icon Set Creator', id: 939343785
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'Numbers', id: 409203825
mas 'Outbank', id: 1094255754
mas 'Pages', id: 409201541
mas 'Paste JSON as Code • quicktype', id: 1330801220
mas 'Pastel', id: 413897608
mas 'Patterns', id: 429449079
mas 'Reeder', id: 1449412482
mas 'Svgsus', id: 1106867065
mas 'Swiftify for Xcode', id: 1183412116
mas 'Things', id: 904280696
mas 'WeatherPro', id: 966486618
