cask_args appdir: '/Applications'
tap 'dart-lang/dart'
tap 'felangel/mason'
tap 'getsentry/tools'
tap 'homebrew/services'
tap 'jjochen/cask'
tap 'leoafarias/fvm'
tap 'pirj/noclamshell'

brew 'ansible'
brew 'ansible-lint'
brew 'arduino-cli'
brew 'aria2'
brew 'astyle'
brew 'bash'
brew 'bash-completion'
brew 'carthage'
brew 'chruby'
brew 'circleci'
brew 'clang-format'
brew 'cmake'
brew 'cmatrix'
brew 'cocoapods'
brew 'coreutils'
brew 'dart-lang/dart/dart'
brew 'ffmpeg'
brew 'findutils'
brew 'leoafarias/fvm/fvm'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-flow'
brew 'git-lfs'
brew 'git-standup'
brew 'gnupg'
brew 'graphicsmagick'
brew 'gs'
brew 'gradle'
brew 'htop'
brew 'imagemagick' # --with-fontconfig --with-librsvg --with-ghostscript'
brew 'java11'
brew 'jq'
brew 'lcov'
brew 'librsvg'
brew 'mas'
brew 'felangel/mason/mason'
brew 'mint'
brew 'moreutils'
brew 'nnn'
brew 'pirj/homebrew-noclamshell/noclamshell', restart_service: true
brew 'node'
brew 'pyenv'
brew 'openssl'
brew 'potrace'
brew 'rcm'
brew 'readline'
brew 'ripgrep'
brew 'ruby-install'
brew 'shellcheck'
brew 'getsentry/tools/sentry-cli'
brew 'ssh-copy-id'
brew 'swi-prolog'
brew 'swiftformat'
brew 'swiftlint'
brew 'switchaudio-osx'
brew 'unp'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'xcodes'
brew 'zoxide'
brew 'yamllint'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

cask '1password'
cask 'alfred'
cask 'android-studio'
cask 'arduino'
cask 'arc'
cask 'balance-lock'
cask 'base'
cask 'chatgpt'
cask 'copilot-for-xcode'
cask 'crystalfetch'
cask 'db-browser-for-sqlite'
cask 'displaylink'
cask 'fantastical'
cask 'figma'
cask 'flycut'
cask 'github'
cask 'google-chrome'
cask 'handbrake'
cask 'hazel'
cask 'istat-menus'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'kawa'
cask 'keepingyouawake'
cask 'mactex'
cask 'miro'
cask 'nucleo'
cask 'obs'
cask 'openvpn-connect'
cask 'paintcode'
cask 'postman'
cask 'provisioning'
cask 'qlmarkdown'
cask 'qlswift'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'renamer'
cask 'sf-symbols'
cask 'signal'
cask 'sketch'
cask 'skim'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'spotter'
cask 'suspicious-package'
cask 'swiftformat-for-xcode'
cask 'teamviewer'
cask 'textmate'
cask 'the-unarchiver'
cask 'tiptoi-manager'
cask 'transmit'
cask 'utm'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'xcodes'
cask 'xscope'
cask 'zoom'

mas '1Password for Safari', id: 1569813296
mas 'DaisyDisk', id: 411643860
mas 'Developer', id: 640199958
mas 'GarageBand', id: 682658836
mas 'Icon Set Creator', id: 939343785
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pastel', id: 413897608
mas 'Patterns', id: 429449079
mas 'Reeder', id: 1449412482
mas 'Svgsus', id: 1106867065
mas 'Swiftify for Xcode', id: 1183412116
mas 'Things', id: 904280696
mas 'WeatherPro', id: 966486618